[
  {
    "image": "https://i.ibb.co/LmVkccJ/youtube.jpg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 1,
    "description": "YouTube is the world’s largest video-sharing platform where users can watch, upload, and share videos on virtually any topic imaginable. From educational tutorials and music videos to vlogs, news, and entertainment, it offers a massive collection of content for every type of viewer. Users can subscribe to their favorite channels, create personalized playlists, and interact with creators through comments and live chats. With YouTube Premium, viewers can enjoy ad-free videos, background play, and exclusive original content. Whether on mobile, web, or TV, YouTube provides a seamless experience that connects billions of people worldwide through creativity, knowledge, and community engagement.",
    "size": 60,
    "reviews": 6300000,
    "ratingAvg": 4.7,
    "downloads": 800000000,
    "ratings": [
      { "name": "1 star", "count": 450000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2350000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://i.ibb.co/m5m10gZS/whatsapp.jpg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "WhatsApp Messenger is a free, secure communication platform that allows users to send text messages, make voice and video calls, and share images, documents, and locations with ease. Developed by Meta Platforms, it is used by billions of people globally to stay in touch with family, friends, and colleagues. WhatsApp uses end-to-end encryption to ensure complete privacy and safety in conversations. It supports group chats, broadcast messages, and even business accounts for customer communication. With features like disappearing messages, custom wallpapers, and WhatsApp Web, it provides a smooth, user-friendly experience that keeps people connected anytime, anywhere in the world.",
    "size": 45,
    "reviews": 7400000,
    "ratingAvg": 4.4,
    "downloads": 740000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 3800000 }
    ]
  },
  {
    "image": "https://i.ibb.co/qL4mZJ1j/tiktok.jpg",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 3,
    "description": "TikTok is a short-form mobile video platform that empowers users to create, watch, and share engaging content. With its easy-to-use editing tools, filters, and soundtracks, anyone can express creativity and connect with a global audience. The app’s powerful algorithm personalizes the ‘For You’ feed, showing videos that match each user’s interests and preferences. From comedy sketches and dance trends to tutorials and lifestyle tips, TikTok has become a hub for viral creativity and entertainment. It also offers tools for creators to go live, collaborate, and grow their audiences, making it one of the most influential social platforms in the world.",
    "size": 55,
    "reviews": 6200000,
    "ratingAvg": 4.6,
    "downloads": 690000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 2300000 },
      { "name": "5 star", "count": 2450000 }
    ]
  },
  {
    "image": "https://i.ibb.co/60MYqJx4/facebook.jpg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "Facebook is a global social networking platform that helps people connect with friends, family, and communities. Users can share posts, photos, videos, and life updates while staying informed through pages, groups, and trending topics. It enables instant communication via Messenger, live streaming, and video calls. Businesses and creators can promote their brands, sell products, and engage followers directly. Facebook’s algorithms personalize the News Feed to show relevant content, and privacy tools help users manage their online presence securely. With billions of active users, Facebook continues to shape how people interact, discover, and build meaningful relationships online every day.",
    "size": 48,
    "reviews": 5600000,
    "ratingAvg": 4.3,
    "downloads": 680000000,
    "ratings": [
      { "name": "1 star", "count": 620000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1600000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 1280000 }
    ]
  },
  {
    "image": "https://i.ibb.co/cSfYB5FW/google.jpg",
    "title": "Google",
    "companyName": "Google LLC",
    "id": 5,
    "description": "Google Search is the world’s most powerful search engine, designed to help users find information quickly and accurately. Whether you’re looking for news, images, videos, local businesses, or research material, Google provides relevant and trustworthy results in seconds. Its advanced algorithms understand user intent, delivering personalized recommendations and smart suggestions. The app integrates seamlessly with other Google services such as Maps, Gmail, YouTube, and Drive for a complete digital experience. With voice search, dark mode, and AI-based tools, Google makes browsing efficient and intuitive. It’s an essential tool for exploring the world’s knowledge right from your device.",
    "size": 42,
    "reviews": 5200000,
    "ratingAvg": 4.5,
    "downloads": 600000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1100000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://i.ibb.co/pBznggBv/instagram.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 6,
    "description": "Instagram is a photo and video sharing social media platform that lets users express themselves through creative visuals. You can post images, reels, and stories, follow favorite creators, and engage with friends through likes, comments, and direct messages. It’s a place where people showcase their passions, lifestyles, and talents. With advanced editing tools, filters, and effects, Instagram enhances creativity and storytelling. Businesses also use it for marketing, brand awareness, and e-commerce through Instagram Shops and Ads. Constantly evolving with features like Reels, Threads, and Live, Instagram connects millions globally through art, inspiration, and authentic human moments every day.",
    "size": 50,
    "reviews": 5900000,
    "ratingAvg": 4.5,
    "downloads": 590000000,
    "ratings": [
      { "name": "1 star", "count": 550000 },
      { "name": "2 star", "count": 850000 },
      { "name": "3 star", "count": 1400000 },
      { "name": "4 star", "count": 2400000 },
      { "name": "5 star", "count": 1700000 }
    ]
  },
  {
    "image": "https://i.ibb.co/gbKTR7Bh/gmail.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 7,
    "description": "Gmail is Google’s trusted email service that combines powerful features with a simple and clean design. It provides users with secure, fast, and organized communication through smart categorization of messages, filters, and search tools. With built-in spam protection, large file attachments via Google Drive, and integration across Google Workspace, Gmail helps users stay productive and connected. It supports multiple accounts, offline access, and advanced privacy settings to keep your inbox safe. Gmail’s mobile app ensures smooth email management anywhere, while AI-powered suggestions make replying and organizing faster. It’s the preferred choice for both personal and professional email needs.",
    "size": 38,
    "reviews": 4800000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 350000 },
      { "name": "2 star", "count": 550000 },
      { "name": "3 star", "count": 950000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "image": "https://i.ibb.co/7dVQgWzR/telegram.jpg",
    "title": "Telegram Messenger",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Telegram Messenger is a fast, cloud-based messaging app known for its speed, security, and powerful features. It allows users to send text messages, media, and files of any type with end-to-end encryption. Telegram supports large group chats, channels for broadcasting, and bots for automation. With its multi-device sync and unlimited cloud storage, you can access your messages from anywhere. The app offers secret chats, self-destructing messages, and strong privacy tools. Users enjoy features like custom themes, polls, stickers, and animated emojis. Telegram combines simplicity with robust functionality, making it one of the most trusted and innovative messaging platforms available.",
    "size": 40,
    "reviews": 4100000,
    "ratingAvg": 4.4,
    "downloads": 409000000,
    "ratings": [
      { "name": "1 star", "count": 380000 },
      { "name": "2 star", "count": 580000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1310000 }
    ]
  },
  {
    "image": "https://i.ibb.co/YB1THJsK/twitter.jpg",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 9,
    "description": "X (formerly Twitter) is a real-time social media platform where people share thoughts, news, and opinions in short posts called ‘tweets.’ It’s the go-to space for discovering breaking news, trending topics, and public conversations across the globe. Users can follow others, reply, repost, and engage with millions of voices instantly. The platform supports long-form posts, live audio discussions via Spaces, and multimedia sharing. X has become an essential tool for journalists, creators, and brands to interact directly with audiences. It continues to evolve as a digital town square—open, fast-paced, and influential in shaping global discussions and movements online.",
    "size": 48,
    "reviews": 4700000,
    "ratingAvg": 4.1,
    "downloads": 220000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 1300000 },
      { "name": "5 star", "count": 900000 }
    ]
  },
  {
    "image": "https://i.ibb.co/6LP56N4/linkedin.jpg",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 10,
    "description": "LinkedIn is the world’s leading professional networking platform, designed to connect professionals, job seekers, and businesses globally. Users can build their career profiles, highlight achievements, and engage with industry experts. The app allows job applications, networking, and skill development through LinkedIn Learning. Companies use LinkedIn to recruit, share insights, and promote their brands. It also offers personalized news feeds, thought leadership content, and communities for professional growth. With features like endorsements, messaging, and event tools, LinkedIn helps individuals and organizations grow connections, stay informed, and advance careers in a trusted and professional environment built for meaningful engagement.",
    "size": 50,
    "reviews": 3600000,
    "ratingAvg": 4.3,
    "downloads": 190000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 900000 }
    ]
  },
  {
    "image": "https://i.ibb.co/LDG07wtf/skype.jpg",
    "title": "Skype",
    "companyName": "Microsoft Corporation",
    "id": 11,
    "description": "Skype is a communication platform by Microsoft that enables free video calls, voice chats, and instant messaging across the world. It’s ideal for personal conversations, business meetings, and group conferences. Skype supports HD video calling, screen sharing, and file transfers, making collaboration simple and effective. Users can call mobile and landline numbers using Skype Credit, and enjoy translation features that bridge language barriers. With end-to-end encryption and cross-platform availability, Skype ensures secure and reliable communication. It remains a trusted choice for millions seeking clear, fast, and easy digital communication on desktop, mobile, and web-based devices worldwide.",
    "size": 44,
    "reviews": 3200000,
    "ratingAvg": 4.2,
    "downloads": 150000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 450000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 750000 }
    ]
  },
  {
    "image": "https://i.ibb.co/zTrHhZzR/photoshop.jpg",
    "title": "Adobe Photoshop",
    "companyName": "Adobe Inc.",
    "id": 12,
    "description": "Adobe Photoshop is the world’s leading photo editing and design software, built for creative professionals and beginners alike. The mobile version brings powerful editing tools like layers, filters, retouching, and AI-powered adjustments right to your fingertips. Users can enhance photos, create digital art, or design graphics with intuitive controls and real-time previews. With seamless integration with Adobe Creative Cloud, you can sync projects across devices. Photoshop supports high-quality exports, custom brushes, and smart selections, making complex edits effortless. Whether for photography, social media design, or illustration, Photoshop empowers creators to bring their visions to life beautifully and professionally.",
    "size": 65,
    "reviews": 2800000,
    "ratingAvg": 4.6,
    "downloads": 120000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1000000 }
    ]
  }
]
